app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    sort = params[:sort] || session[:sort]

    @movies = Movie.all